InformationRegisters/ПоврежденияАвтомобилей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ПоврежденияАвтомобилей</Name>
			<Comment>Повреждения автомобилей</Comment>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПоврежденияУстранены</Name>
					<Comment>Повреждения устранены</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаУстраненияПлан</Name>
					<Comment>Плановая дата устранения повреждения</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаУстранения</Name>
					<Comment>Фактическая дата устранения повреждения</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипПовреждения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыПовреждений</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОписаниеПовреждения</Name>
					<Comment>Описание повреждения</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>180</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерПовреждения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Comment>Автор</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
						<v8:Type>cfg:CatalogRef.ВнешниеПользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаИзменения</Name>
					<Comment>Дата изменения</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МедиаФайл</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДефектовочнаяВедомостьПрисоединенныеФайлы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Автомобиль</Name>
					<Comment>Автомобиль</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Автомобили</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УдалитьОписаниеПовреждения</Name>
					<Comment>Описание повреждения (удаление)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>180</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдентификаторПовреждения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ДефектовочнаяВедомость</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ПоврежденияАвтомобилей/Forms/ФормаСписка/Ext/Form/Module.bsl
///////////////////////////////////////////////////////////////////////////////
// Модуль формы списка регистра "Действие скидок и маркетинговых программ"
//
///////////////////////////////////////////////////////////////////////////////

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Перем Автомобиль;
	
	Если Параметры.Свойство("Отбор") И Параметры.Отбор.Свойство("Автомобиль") Тогда
		Автомобиль = Параметры.Отбор.Автомобиль;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Автомобиль) Тогда
		Элементы.Автомобиль.Видимость = Ложь;
		Заголовок = СтрШаблон(НСтр("ru = 'Повреждения автомобиля [%1]'"), Автомобиль);
	КонецЕсли;
	
	УстановитьУсловноеОформлениеСписка(Список.УсловноеОформление, ПоляСписка());
	
	Элементы.ФормаУстранено.Видимость = ПравоДоступа("Изменение", Метаданные.РегистрыСведений.ПоврежденияАвтомобилей);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	Элементы.ФормаУстранено.Отображение = ОтображениеКнопки.КартинкаИТекст;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	// ОценкаПроизводительности
	Если Копирование Тогда
		ОценкаПроизводительностиКлиент.ЗамерВремени("КопированиеРегистраСведенийАвтомобили");
	Иначе
		ОценкаПроизводительностиКлиент.ЗамерВремени("СозданиеРегистраСведенийАвтомобили");
	КонецЕсли;
	// Конец ОценкаПроизводительности
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПередНачаломИзменения(Элемент, Отказ)
	
	ОценкаПроизводительностиКлиент.ЗамерВремени("ОткрытиеЗаписиРегистраСведенийАвтомобили");
	
КонецПроцедуры

&НаСервере
Процедура СписокПриЗагрузкеПользовательскихНастроекНаСервере(Элемент, Настройки, ИспользуютсяСтандартныеНастройки)
	
	РаботаСФормой.НастроитьОсновнойДинамическийСписокФормы(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Устранено(Команда)
	
	Результат = ОтметитьКакУстраненные(Элементы.Список.ВыделенныеСтроки);
	Если ЭтоОшибка(Результат) Тогда
		ПоказатьПредупреждение(, Результат.Сообщение,, НСтр("ru = 'Ошибка установки признака ""Устранено""'"));
	Иначе
		Элементы.Список.Обновить();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиентеНаСервереБезКонтекста

Функция ЭтоОшибка(Данные)
	
	Возврат (ТипЗнч(Данные) = Тип("Структура") И Данные.Свойство("Ошибка") И Данные.Ошибка);
	
КонецФункции

&НаСервереБезКонтекста
Функция ОтметитьКакУстраненные(Знач КлючиЗаписей)
	
	Для Каждого Ключ Из КлючиЗаписей Цикл
		Если Ключ.Пустой() Тогда
			Продолжить;
		КонецЕсли;
		
		Менеджер = РегистрыСведений.ПоврежденияАвтомобилей.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(Менеджер, Ключ);
		Менеджер.Прочитать();
		Если Менеджер.Выбран() И НЕ Менеджер.ПоврежденияУстранены Тогда
			Менеджер.ПоврежденияУстранены = Истина;
			Менеджер.ДатаУстранения       = ТекущаяДатаСеанса();
			Попытка
				Менеджер.Записать(Истина);
			Исключение
				Возврат Новый Структура("Ошибка,Сообщение", Истина, КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
			КонецПопытки;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Неопределено;
	
КонецФункции

&НаСервереБезКонтекста
Процедура УстановитьУсловноеОформлениеСписка(УсловноеОформление, ПоляУсловногоОформления)
	
	// красный цвет
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	Для Каждого Поле Из ПоляУсловногоОформления Цикл
		ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
		ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Поле);
	КонецЦикла;
	
	ГруппаОтбора = Элемент.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаОтбора.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;
	
	ОтборЭлемента = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ПоврежденияУстранены");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Ложь;
	
	ОтборЭлемента = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ДатаУстраненияПлан");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Меньше;
	ОтборЭлемента.ПравоеЗначение = ТекущаяДатаСеанса();
	
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ЦветОсобогоТекста);
	
	// жирный шрифт
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	Для Каждого Поле Из ПоляУсловногоОформления Цикл
		ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
		ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Поле);
	КонецЦикла;
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ПоврежденияУстранены");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Ложь;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("Шрифт", Новый Шрифт(,, Истина));
	
КонецПроцедуры

&НаСервере
Функция ПоляСписка()
	
	Поля = Новый Массив;
	
	Для Каждого Элемент Из Элементы.Список.ПодчиненныеЭлементы Цикл
		Поля.Добавить(Элемент.Имя);
	КонецЦикла;
	
	Возврат Поля;
	
КонецФункции

#КонецОбласти
